# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders` from the file `Oders.csv` located in the `data` folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [11]:
orders = pd.read_csv("../data/Orders.csv", index_col=0)

In [12]:
orders.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [13]:
orders.groupby("CustomerID")["amount_spent"].sum()

CustomerID
12346    77183.60
12347     4310.00
12348     1797.24
12349     1757.55
12350      334.40
           ...
18280      180.60
18281       80.82
18282      178.05
18283     2094.88
18287     1837.28
Name: amount_spent, Length: 4339, dtype: float64

In [19]:
uni_cust = pd.DataFrame(orders.groupby("CustomerID")["amount_spent"].sum())

In [20]:
uni_cust

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40
...                  ...
18280             180.60
18281              80.82
18282             178.05
18283            2094.88
18287            1837.28

[4339 rows x 1 columns]

In [21]:
pd.qcut(uni_cust["amount_spent"], q = [0, 0.75, 0.95, 1], labels = ["Others", "Preferred", "VIP"])

CustomerID
12346          VIP
12347    Preferred
12348    Preferred
12349    Preferred
12350       Others
           ...
18280       Others
18281       Others
18282       Others
18283    Preferred
18287    Preferred
Name: amount_spent, Length: 4339, dtype: category
Categories (3, object): ['Others' < 'Preferred' < 'VIP']

In [22]:
uni_cust["Categories"] = pd.qcut(uni_cust["amount_spent"], q = [0, 0.75, 0.95, 1], labels = ["Others", "Preferred", "VIP"])

In [23]:
uni_cust

            amount_spent Categories
CustomerID
12346           77183.60        VIP
12347            4310.00  Preferred
12348            1797.24  Preferred
12349            1757.55  Preferred
12350             334.40     Others
...                  ...        ...
18280             180.60     Others
18281              80.82     Others
18282             178.05     Others
18283            2094.88  Preferred
18287            1837.28  Preferred

[4339 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [27]:
cust_country = pd.DataFrame(orders.groupby(["CustomerID", "Country"])["amount_spent"].sum())

In [29]:
cust_country["Categories"] = pd.qcut(cust_country["amount_spent"], q = [0, 0.75, 0.95, 1], labels = ["Others", "Preferred", "VIP"])

In [42]:
cust_country.groupby("Country").count("VIP")

TypeError: count() takes 1 positional argument but 2 were given

In [32]:
cust_country.groupby(["Categories"]).count()

            amount_spent
Categories
Others              3260
Preferred            869
VIP                  218

In [33]:
cust_country.groupby(["Country"]).count()

                      amount_spent  Categories
Country
Australia                        9           9
Austria                         11          11
Bahrain                          2           2
Belgium                         25          25
Brazil                           1           1
Canada                           4           4
Channel Islands                  9           9
Cyprus                           8           8
Czech Republic                   1           1
Denmark                          9           9
EIRE                             3           3
European Community               1           1
Finland                         12          12
France                          87          87
Germany                         94          94
Greece                           4           4
Iceland                          1           1
Israel                           3           3
Italy                           14          14
Japan                            8           8
Lebanon                          1           1
Lithuania                        1           1
Malta                            2           2
Netherlands                      9           9
Norway                          10          10
Poland                           6           6
Portugal                        19          19
RSA                              1           1
Saudi Arabia                     1           1
Singapore                        1           1
Spain                           30          30
Sweden                           8           8
Switzerland                     21          21
USA                              4           4
United Arab Emirates             2           2
United Kingdom                3921        3921
Unspecified                      4           4

In [34]:
cust_country.groupby(["Country", "Categories"]).count()

                           amount_spent
Country        Categories
Australia      Others               5.0
               Preferred            3.0
               VIP                  1.0
Austria        Others              10.0
               Preferred            1.0
...                                 ...
United Kingdom Preferred          756.0
               VIP                178.0
Unspecified    Others               4.0
               Preferred            NaN
               VIP                  NaN

[111 rows x 1 columns]

In [46]:
cust_country.groupby(["Country", "Categories"=="VIP"]).count()

KeyError: False

In [35]:
cust_country.groupby("Country")["Categories"].count()

Country
Australia                  9
Austria                   11
Bahrain                    2
Belgium                   25
Brazil                     1
Canada                     4
Channel Islands            9
Cyprus                     8
Czech Republic             1
Denmark                    9
EIRE                       3
European Community         1
Finland                   12
France                    87
Germany                   94
Greece                     4
Iceland                    1
Israel                     3
Italy                     14
Japan                      8
Lebanon                    1
Lithuania                  1
Malta                      2
Netherlands                9
Norway                    10
Poland                     6
Portugal                  19
RSA                        1
Saudi Arabia               1
Singapore                  1
Spain                     30
Sweden                     8
Switzerland               21
USA                        4
United Arab Emirates       2
United Kingdom          3921
Unspecified                4
Name: Categories, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?